app/views/currency/show.html.erb

SELECT `plans`.* FROM `plans` WHERE `plans`.`currency_id` = 13
---
<div class="highlights">
	<% @currency.plans.each do |plan| %>