app/controllers/currency_controller.rb

  def show
    @currency = Currency.where(short_name: params[:id]).first
---
SELECT  `currencies`.* FROM `currencies` WHERE `currencies`.`short_name` = 'btc' ORDER BY `currencies`.`id` ASC LIMIT 1